<template>
    <div>
        <div class="mui-card" style="margin:10px 0">
			<div class="mui-card-header">校园环境</div>
			<div class="mui-card-content">
				<div class="mui-card-content-inner">
                    <div v-for="(a,i) of imglist" :key="i">
                        <img :src="a" style="width:100%;">
                    </div>
				</div>
			</div>
			<div class="mui-card-footer">
					学校现为24轨，共72个教学班，在校学生4000余人。
                    现有教职工358名，专业老师280名，其中特级教师2名，高级教师51名，一级教师76
                    名，省级学科带头人、骨干教师、教学能手21名，市级学科带头人、
                    骨干教师、教学能手34名，研究生学历18名，本科学历318名。
                    学校全面推行以“学案课堂”为核心的课堂改革，并总结归纳出师生“导与学”八字方针，
                    即教师注重“编、验、点、导”，学生力行“学、做、展、悟”，把课堂分为四种类型，
                    即自主课、展示课、训练课和反思课。丰富的课堂为提高学生综合素质搭建了平台，
                    半天的自主学习给了学生广阔的创新空间，展示的舞台使学生自我价值得到充分体现。
                    高考成绩连年攀升，应届生达线率超过50%。
                    第七届全国中小学全效学习方案研究与实验项目研讨和成果展示会在该校举行；
                    运城市高中教学工作和课堂改革现场会在该校召开了三次；
                    省教育厅副厅长张卓玉先后三次深入学校调研指导课改，充分肯定了学校的改革方向和办学理念，
                    并题词：“在新绛中学看到了中国教育的希望和未来”。
                    为促进学校可持续发展，新绛中学启动了新校区建设工程。新校区占地312亩，
                    建筑面积12万平方米，工程总投资约2.5亿元。主要建筑包括3栋教学楼、
                    4栋学生公寓楼、1栋教工宿舍楼、2座餐厅、2座阶梯教室、1座图书科技楼、1座办公楼、
                    1个标准化体育场及满足教育教学需要的附属设施，可满足4500名学生的学习和生活需求。
                    目前，新校区建设工程已完工，整体搬迁工作也已全部完成
            </div>
		</div>
    </div>
</template>


<script>
export default {
    data(){
        return{
            imglist:[]
        }
    },
    created(){
        this.img_list();
    },
    methods:{
        img_list(){
            this.axios.get('http://127.0.0.1:3000/imglist').then(result=>{
                this.imglist=result.data.data
            })
        }
    }
}
</script>


<style>

</style>
